N = 0

# 二進数に変換
bin(5)

# 16進数に変換
hex(3)

# n進数から10進数に変換
a = int("1001", 2)  # 2進数
b = int("75", 8)  # 8進数
c = int("91", 10)  # 10進数
d = int("c3", 16)  # 16進数

# 01のパターン
# 一度16進数にしてから二進数へ
b = "0b010101"
b = bin(int("0x5555555555555555", 16))  # 16進数の5が16個 = 01 が64個(4*16)

# ある桁から上を取り除く
a = (a >> N) << N

# ある桁から下を取り除く
mask = (1 << 3) - 1  # 0b0111 (7) を作成
result = 11 & mask

# 左シフト
a = 5 << 0

# 右シフト
a = 5 >> 0

# 論理積(AND)
a = 0 & 1

# 論理和(OR)
a = 0 | 1

# 排他的論理和
a = 0 ^ 1

# 掛け算
a = 1 << N
a = 2**N
b = 5 << N
b = 5 * 2**N

# 割り算(切り捨て)
a = 2 >> N
a = 2 // (2**N)

# ビット演算による部分集合の列挙
dp = [[0] * 2**N for _ in range(N)]

i = 0
for j in range(1, 2**N):
    k = j
    while True:
        if k == 0:
            break
        dp[i][j] = min(dp[i][j], dp[i][k])
        k = (k - 1) & j

"""
k - 1 を計算すると、最下位の立っているビット（1）が 0 になり、それより下位のビットがすべて 1 に反転します。
これに対し、元の集合 j との論理積（& j）を取ることで、「j に含まれていない余計なビット」を削ぎ落とします。
結果として、集合 j に含まれるビットだけを使い、辞書順で1つ手前の部分集合 k へとジャンプすることができます。
"""
